//説明
window.alert("ループとはプログラムにおいて繰り返しを行う処理のことをいいます");

window.alert("JavaScriptでループを行う時にはfor文（フォーぶん）を使う");

window.alert("【var i = 0;】 この部分は >>初期化式<< と言ってループを開始する時の一番最初に実行してくれる処理です")

window.alert("次に");

window.alert("【i < 100;】この部分は >>条件式<< と言って、繰り返しをしてよいかの真偽値を書く部分です");

window.alert("最後に");

window.alert("【i++;】この部分は、変化式と言って、ループの繰り返し処理前に実行される処理です");

window.alert("この【 i++ 】という書き方は、【i = i + 1;】代入命令を簡略化して書いたもので、数値iを1だけ増やして代入するという処理をします");

window.alert(" 【for（初期化式; 条件式; 変化式;{ 繰り返したい処理 }】");

window.alert("for文の処理順序");

window.alert("1⃣：変数 i に 1 が代入される");

window.alert("2⃣5⃣8⃣：条件式によってループをするかチェックする");

window.alert("3⃣6⃣：ループする場合、（　）の間に記載されているプログラムを実行する");

window.alert("4⃣7⃣：変化式したがって i の値が 1 大きくなる");

window.alert("以上で説明は終わりになります");